const MESSAGES = {
  welcome: ({ name }: { name }) =>
    `👋🏻 سلام *${name}*!\n🔸 به *ربات رزرو غذا دانشگاهی* خوش اومدی.\n\n🔻  برای استفاده از ربات، یکی از دکمه‌های زیر رو انتخاب کن.`,
  getUsername: '🧍🏻‍♂️ *نام کاربری* سماد رو بفرست.',
  getPassword: `🔓 *رمز عبور* سماد رو بفرست.
  📌 *توجه*: معمولاً رمز عبور سماد، کدملیته.
  🗳 *نکته*: رمزت توی این ربات ذخیره نمی‌شه.`,
  reserve: 'رزرو غذا',
  back: '← بازگشت به منوی اصلی',
  error: '❌ *متوجه منظورت نشدم!*\n🔻 لطفاً از دکمه‌های ربات استفاده کن.',
  letMeCheck: ' 🔎 درحال پردازش اطلاعات ...',
  wrongUsernamrOrPassword: '❌ *نام کاربری یا رمز رو اشتباه فرستادی.*',
  autoReserve: 'تنظیم رزرو خودکار',
  notFound: 'چیزی یافت نشد!',
  letMeSendSelfs: 'بذار لیست سلف‌ها رو برات بفرستم که انتخاب کنی ...',
  letMeSendFoods: 'بذار لیست غذاهارو دربیارم ...',
  nextWeek: 'هفتهٔ بعد ⏪',
  selfName: '🍽️ نام سلف',
  thisWeekReservesList: '🍟 لیست رزروهای این هفته: \n\n',
  nextWeekReservesList: '🍟 لیست رزروهای هفتهٔ بعد: \n\n',
  foodName: '🍕 نام غذا',
  price: '💳 قیمت',
  date: '📅 تاریخ',
  currency: 'ریال',
  number: 'شماره',
  day: '📅 روز',
  notFoundFoodForThisWeek: '💢 متأسفم!\nبرای این هفته غذایی پیدا نکردم. اگه بخوای می‌تونی با استفاده از دکمهٔ زیر، هفتهٔ بعد رو چک کنی.',
  sorryNotFoundAnyFood:
    '💢 متأسفم!\nتوی این هفته هم چیزی پیدا نکردم. می‌تونی بری به منوی اصلی، از اون‌جا به قسمت کد فراموشی بری و ببینی غذایی هست یا نه.',
  lostCode: 'کد فراموشی (آزمایشی)',
  getLostCode: 'دریافت کد فراموشی',
  shareLostCode: 'ارسال کد فراموشی',
  reportBadCode: 'گزارش کد فراموشی اشتباه',
  findFromBelow: '🔻 یکی از دکمه‌های زیر رو انتخاب کن.',
  successFullLostCode: '✅ کد فراموشی به لیست اضافه شد.\n',
  unSuccessFullLostCode:
    '❌ یه مشکلی پیش اومده!\n🔻 شاید غذات مشکلی داره یا شاید من مشکلی دارم. بهتره سایت سماد رو چک کنی. اگه به نظرت مشکل از منه، لطفاً به پشتیبانی پیام بده.',
  notFoundLostCode: '😔 متأسفم! واقعا دنیای بدی شده!\n هیچ کدی ندارم که بهت بدم. :(\n با بچه‌های دانشکده‌تون صحبت کن تا بیان توی بات کد فراموشی به اشتراک بذارن.',
  successFullLostCodeGet: '✅ به به! دم بچه‌های دانشکده‌تون گرم که به فکر همدیگه‌ان!\nبیا اینم کد، نوش جونت! یادت باشه بعداً برای بقیه جبران کنی. :)))',
  supportLostCode: '🔻 کد فراموشی *اشتباه* رو وارد کن تا پیگیری کنم.',
  weWouldCheck: '👍 ممنون!\nکد فراموشی اشتباه رو گرفتم و در اولین فرصت بررسی می‌کنم.',
  mealType: 'وعدهٔ غذایی',
  setAutoReserve: 'تنظیم رزرو خودکار',
  reserveThisWeek: 'رزرو غذای این هفته',
  reserveNextWeek: 'رزرو غذای هفتهٔ بعد',
  changeSecondPass: 'تغییر رمز دوم',
  logout: 'خروج',
  login: 'ورود به حساب کاربری',
  supportMessage: 'پیامتو بفرست.',
  supportMessageSent: 'ارسال شد.',
  thisWeekReserves: 'لیست رزروهای این هفته',
  nextWeekReserves: 'لیست رزروهای هفتهٔ بعد',
  nextWeekFoods: 'غذاهای هفته بعد',
  thisWeekFoods: 'غذاهای این هفته',
  myInfo: 'اطلاعات من',
  myInfoMessage: ({ name, uniName, id, username, credit, lastName }: { name; uniName; id; username; credit; lastName }) =>
    `🍔 *اطلاعات تو*
• نام: *${name} ${lastName}*
• نام دانشگاه: *${uniName}*
• موجودی حساب: *${credit / 10}* تومان
• آی‌دی: *${id}*
• نام کاربری: *${username}*`,
  about: 'دربارهٔ ربات',
  aboutMessage:
  '💡 *دربارهٔ ربات*\n🔸 این ربات توسط دانشجویان دانشگاه خواجه نصیرالدین طوسی طراحی شده. هدف این ربات فقط راحتی دانشجویان برای کار با سامانهٔ سماد دانشگاهیه.\n❤️ ارتباط با ما:\n• @Ghanbari\\_Matin\n• @Malekeym\n⭐️ لطفاً برای حمایت از ما، به این پروژه در گیت‌هاب استار بدین.\n• https://github.com/malekeym/DiningReservation',
  support: 'پشتیبانی',
  successFullyLogout: 'با موفقیت خارج شدی.',
  unsuccessFullOperation: 'یه مشکلی پیش اومد.',
  autoReserveStatus: '🔸 *وضعیت رزرو خودکار*',
  active: '✅ فعال',
  deActive: '❌ غیرفعال',
  activeDays: '📅 *روزهای فعال*',
  noDay: 'هیچ روز',
  activateAutoReserve: 'فعال‌سازی رزرو خودکار',
  deActivateAutoReserve: 'غیرفعال‌سازی رزرو خودکار',
  changeAutoReserveDays: 'تغییر تنظیمات رزرو خودکار',
  activateSuccessFully: 'رزرو خودکار فعال شد.',
  deActivateSuccessFully: 'رزرو خودکار غیرفعال شد.',
  chooseDays: 'روزهای مدنظرتو از منوی زیر انتخاب کن.',
  isAdded: 'اضافه شد.',
  isRemoved: 'حذف شد.',
  showAutoReserveStatus: 'نمایش اطلاعات رزرو خودکار',
  youShouldLoginFirst: 'باید اول وارد بشی.',
  noReserve: 'رزروی وجود نداره.',
  getUniversity: '🏫 اسم دانشگاهت رو انتخاب کن.',
  notFoundProgram: 'سلف برای امروز هیچ برنامهٔ غذایی‌ای نداره.',
  help: `
  🍟 ربات رزرو غذای دانشگاهی

🌮 برای رزرو غذا، از منوی رزرو غذا، این هفته یا هفتهٔ بعد رو انتخاب کن. بعد، اسم سلف موردنظرت رو انتخاب کن تا لیست غذاهای موجود رو ببینی. حالا با کلیک روی دکمهٔ هر غذا، در صورت داشتن موجودی کافی، رزرو در لحظه انجام می‌شه و اگر موجودیت کافی نباشه، ربات پیام عدم موجودی کافی رو برات ارسال می‌کنه. 
🔶 رزرو غذا *فوریه*؛ یعنی درجا یا برات رزرو می‌کنه یا بهت خطای مربوطه رو نشون می‌ده.
🍖 برای دیدن لیست غذاهای رزروشده، با کلیک روی لیست رزروهای این هفته یا هفتهٔ بعد می‌تونی لیست کامل غذاهای رزرو شده‌ت رو ببینی. 

🦠 اگر مشکلی توی بات دیدی، از طریق آی‌دی‌هایی که در قسمت درباره هست، مشکلت رو برامون ارسال کن تا درستش کنیم.

👥  با معرفی این ربات به دوستات می‌تونی خیلی به ما در توسعهٔ ربات کمک کنی.`,
  notAvailable:
  'این بخش به علت تغییرات سیستم در دسترس نیست، اما می‌تونی با مراجعه به قسمت رزرو غذا، به‌راحتی و درلحظه غذای مورد نظرت رو رزرو کنی.',
  tag: '\n\n🍟 URB: @University\\_Reservation\\_Bot',
};

export const DAYS = ['شنبه', 'یک‌شنبه', 'دوشنبه', 'سه‌شنبه', 'چهارشنبه', 'پنج‌شنبه', 'جمعه'];

export const UNIVERSITIES = {
  3: 'دانشگاه شهید بهشتی (آزمایشی)',
  6: 'دانشگاه صنعتی امیرکبیر (آزمایشی)',
  7: 'دانشگاه صنعتی شریف (آزمایشی)',
  8: 'دانشگاه صنعتی خواجه نصیرالدین طوسی',
};

export default MESSAGES;
